[
  {
    "title": "Tan Ser Seng Herbs Restaurant: SG’s First Claypot Turtle Soup + Traditional & Nourishing Ginseng Chicken Soup Since 1946 In Geylang",
    "post": "Located in Geylang, Tan Ser Seng Herbs Restaurant is one of the remaining turtle soup restaurants in Singapore, and the first to cook turtle soup in a claypot. The rich turtle soup is made daily with quality ingredients and fresh turtle meat. Simmered for more than 12 hours every day, it’s hearty, full of collagen, healthy and absolutely delicious. The authentic recipe dates back to 1946! The family-run restaurant also cooks nourishing herbal soups, such as cordyceps chicken soup, ginseng black chicken soup and more.",
    "link": "https://sethlui.com/tan-ser-seng-herbs-restaurant-geylang-singapore/",
    "author": "sethlui.com",
    "content": "summary"
  },
  {
    "title": "Waa Cow Sushi Bar: Come For Its Affordable Aburi Beef Bowl & Assorted Premium Wagyu Sushi At Raffles Place",
    "post": "The good people behind Waa Cow has brought its famous beef bowl all the way from the National University of Singapore to Raffles Place MRT’s Raffles Xchange. On top of its affordable beef bowls, Waa Cow Sushi Bar serves premium assorted wagyu beef sushi with a pretty affordable price tag. We all know that it is difficult to find decently priced quality food in the Central Business District, but Waa Cow’s here to change the game and bonus points for the neon pink signs that added a modern touch to this restaurant. The interior was brightly lit with a wallpaper reminiscent of ‘The Great Wave off Kanagawa’, a classic piece of Japanese art from the Edo-period. Overall, it gives off a contemporary-meets-traditional vibe. Only available during dinner, we tried the Ultimate Beef Sushi Experience ($36.80) that includes eight pieces of Wagyu beef sushi with different flavour profiles. If you want something lighter, go for the Petite Wagyu Sushi Platter ($16.90) that has four pieces instead of eight.",
    "link": "https://sethlui.com/waa-cow-sushi-bar-singapore/",
    "author": "sethlui.com",
    "content": "summary"
  },
  {
    "title": "OMU: Try Egg-cellent, Flowy Lava Omu Rice From Thailand At Suntec City Mall",
    "post": "First established in Thailand in 2010, the Japanese franchise has now arrived in Singapore! OMU is located at Suntec City Mall, just a stone’s throw from the entrance of Esplanade MRT. At OMU, you can choose from various sauces and toppings to go with their signature tomato fried rice, such as Japanese curry, to demi-glace sauce and pink mentaiko cream sauce. The restaurant is decked out in simple wood, grey and green furnishing, and boasts two separate dining areas, catering to OMU’s unique “L”-shaped shop space. What caught me about its interior was the special ceiling designed to look like a nest made of twigs.",
    "link": "https://sethlui.com/omu-lava-egg-suntec-city-mall-singapore/",
    "author": "sethlui.com",
    "content": "summary"
  }
]